src/Documents/ПоступлениеДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПоступлениеДенежныхСредств</Name>
			<BasedOn>
				<xr:Item>Document.ВозвратПоставщику</xr:Item>
				<xr:Item>Document.Реализация</xr:Item>
				<xr:Item>Document.АктОказанияУслуг</xr:Item>
				<xr:Item>Document.ВозвратОтПокупателя</xr:Item>
				<xr:Item>Document.АвансовыйОтчет</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСПодотчетниками</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоЭквайрингу</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентами</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредстваНаЛицевыхСчетах</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСПерсоналом</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ID_Транзакции</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчетКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвратВыплатыЗПДокументОснования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НачислениеЗарплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвратВыплатыЗПМесяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассоваяСмена</Name>
					<Comment>Кассовая смена</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.КассоваяСмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСинхронизации</Name>
					<Comment>Код синхронизации с ID загружаемой базы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчетКонтрагента</Name>
					<Comment>Лицевой счет списания или зачисления денежных средств</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЧекаККМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяВТаблице</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДенежныхСредств</Name>
					<Comment>Тип денежных средств</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭквайрингВидПлатежнойКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭквайрингКодАвторизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭквайрингНомерПлатежнойКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>22</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭквайрингНомерЧека</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭквайрингСсылочныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭквайрингСуммаКомиссииБанка</Name>
					<Comment>Сумма комиссии банка удерживаемая эквайером</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭквайрингТерминал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭквайринговыеТерминалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатаПоСсылке</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПлатежныеШлюзы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасшифровкаПлатежа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументОснования</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Реализация</v8:Type>
								<v8:Type>cfg:DocumentRef.НачислениеЗарплаты</v8:Type>
								<v8:Type>cfg:DocumentRef.ВозвратПоставщику</v8:Type>
								<v8:Type>cfg:DocumentRef.ПланЛечения</v8:Type>
								<v8:Type>cfg:DocumentRef.СписаниеДенежныхСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.Прием</v8:Type>
								<v8:Type>cfg:DocumentRef.НарядЗаказ</v8:Type>
								<v8:Type>cfg:DocumentRef.ВозвратОтПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументАванса</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПланЛечения</v8:Type>
								<v8:Type>cfg:DocumentRef.НарядЗаказ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статья</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоАванс</Name>
							<Comment>Это аванс от контрагента</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНалога</Name>
							<Comment>Вид возвращаемого налога</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыСистемНалогообложенияККТ</v8:Type>
								<v8:Type>cfg:CatalogRef.ВидыНалогов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Enums/ВидыОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыОпераций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВводОстатков</Name>
					<Comment>Ввод остатков</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзносНаЛицевойСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзносУчредителя</Name>
					<Comment>Взнос учредителя</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возврат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратЗайма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратЗаработнойПлаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратНалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОплатыКлиенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОплатыОтПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОплатыСтраховойКомпании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтПодотчетника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтСотрудника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОшибочнойОплатыКлиенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратСЛицевогоСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыбытиеВКассу</Name>
					<Comment>Для фин. операций. Отправка банком ден. средств в организацию</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗайма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаПодотчетнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаДивидендовУчредителю</Name>
					<Comment>ВыплатаДивидендовУчредителю</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаЗаработнойПлаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗачислениеСертификата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеБонусныйСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаНалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаОтКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаОтСтраховойКомпании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеМеждуСкладами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещенияМеждуСотрудниками</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСкладу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеИзБанка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеИзКассы</Name>
					<Comment>Для фин. операций. Поступление фиксация поступления ден. средств в банк </Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеОтЭквайера</Name>
					<Comment>Поступление от эквайера</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продажа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееПоступление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееСписание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СдачаНаличныхВБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеБонусныйСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеРозничнойВыручкиИзОперационнойКассы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеИзКассыПредприятия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СдачаРозничнойВыручкиВКассуПредприятия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыбытиеВОперационнуюКассу</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ПоступлениеДенежныхСредств/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - обработчик события "ПриСозданииНаСервере" формы.
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтборСтрЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "СтруктурнаяЕдиница", ОтборСтрЕдиница, ЗначениеЗаполнено(ОтборСтрЕдиница));	
	Элементы.КонтрагентОтбор.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
	Элементы.КассаОтбор.ОграничениеТипа      = Новый ОписаниеТипов("СправочникСсылка.Кассы");

КонецПроцедуры // ПриСозданииНаСервере()

&НаСервере
// Обработчик после загрузки настроек формы на сервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Если ОтборВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВозвратОтПодотчетника") Тогда
	     Элементы.КонтрагентОтбор.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Сотрудники");
		 Элементы.КонтрагентОтбор.Заголовок       = "Сотрудник";
    Иначе
	 	 Элементы.КонтрагентОтбор.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
		 Элементы.КонтрагентОтбор.Заголовок       = "Контрагент";
	КонецЕсли;	
	
	Если ОтборТипДенСредств = ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.Безналичные") Тогда
	     Элементы.КассаОтбор.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.БанковскиеСчета");
		 Элементы.КассаОтбор.Заголовок       = "Банковский счет";
    Иначе
	 	 Элементы.КассаОтбор.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Кассы");
		 Элементы.КассаОтбор.Заголовок       = "Касса";
	КонецЕсли;	
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "СтруктурнаяЕдиница", ОтборСтрЕдиница, ЗначениеЗаполнено(ОтборСтрЕдиница));
    ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "ТипДенежныхСредств", ОтборТипДенСредств, ЗначениеЗаполнено(ОтборТипДенСредств));
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "ВидОперации", ОтборВидОперации, ЗначениеЗаполнено(ОтборВидОперации));
    ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Контрагент", ОтборКонтрагентСотрудник, ЗначениеЗаполнено(ОтборКонтрагентСотрудник));
    ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Касса", ОтборКассаБанковскийСчет, ЗначениеЗаполнено(ОтборКассаБанковскийСчет));
		 
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

////////////////////// ОБРАБОТЧИКИ ЭЛЕМЕНТОВ ОТБОРА /////////////////////////

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля СтрЕдиницаОтбор
//
Процедура СтрЕдиницаОтборПриИзменении(Элемент)
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "СтруктурнаяЕдиница", ОтборСтрЕдиница, ЗначениеЗаполнено(ОтборСтрЕдиница));
КонецПроцедуры

&НаКлиенте
// При изменениие типа ден. средств
Процедура ОтборТипДенСредствПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "ТипДенежныхСредств", ОтборТипДенСредств, ЗначениеЗаполнено(ОтборТипДенСредств));
	
	Если ОтборТипДенСредств = ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.Безналичные") Тогда
	     Элементы.КассаОтбор.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.БанковскиеСчета");
		 Элементы.КассаОтбор.Заголовок       = "Банковский счет";
    Иначе
	 	 Элементы.КассаОтбор.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Кассы");
		 Элементы.КассаОтбор.Заголовок       = "Касса";
	КонецЕсли;	
	 
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Касса", ОтборКассаБанковскийСчет, ЗначениеЗаполнено(ОтборКассаБанковскийСчет));
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля ВидОперацииОтбор
//
Процедура ВидОперацииОтборПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "ВидОперации", ОтборВидОперации, ЗначениеЗаполнено(ОтборВидОперации));
	
	Если ОтборВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВозвратОтПодотчетника") Тогда
	    Элементы.КонтрагентОтбор.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Сотрудники");
		Элементы.КонтрагентОтбор.Заголовок       = "Сотрудник";
    Иначе
		Элементы.КонтрагентОтбор.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
		Элементы.КонтрагентОтбор.Заголовок       = "Контрагент";
	КонецЕсли;	
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Контрагент", ОтборКонтрагентСотрудник, ЗначениеЗаполнено(ОтборКонтрагентСотрудник));
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля КонтрагентОтбор
//
Процедура КонтрагентОтборПриИзменении(Элемент)
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Контрагент", ОтборКонтрагентСотрудник, ЗначениеЗаполнено(ОтборКонтрагентСотрудник));
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля КассаОтбор
//
Процедура КассаОтборПриИзменении(Элемент)
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Касса", ОтборКассаБанковскийСчет, ЗначениеЗаполнено(ОтборКассаБанковскийСчет));
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

////////////////////// ОБРАБОТЧИК КНОПОК СОЗДАНИЯ ДОКУМЕНТОВ ///////////////////

 &НаКлиенте
// Процедура вызывается обработчиком любой кнопки создания документа 
Процедура ОбщийОбработчикСозданияДокументов(Команда)
	
	ПараметрТипДенСредств = Неопределено;
	ПараметрВидОперации   = Неопределено;
	ПараметрТипДенСредств = ?(СтрЧислоВхождений(Команда.Имя,"ЛицевойСчет")                 >0 ,ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.ЛицевойСчет"),ПараметрТипДенСредств);
	ПараметрТипДенСредств = ?(СтрЧислоВхождений(Команда.Имя,"Безналичные")                 >0 ,ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.Безналичные"),ПараметрТипДенСредств);
    ПараметрТипДенСредств = ?(СтрЧислоВхождений(Команда.Имя,"ПлатежнаяКарта")              >0 ,ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.ПлатежнаяКарта"),ПараметрТипДенСредств);
    ПараметрТипДенСредств = ?(СтрЧислоВхождений(Команда.Имя,"Наличные")                    >0 ,ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.Наличные"),ПараметрТипДенСредств);
		
	ПараметрВидОперации   = ?(СтрЧислоВхождений(Команда.Имя,"ОплатаОтКлиента")             >0 ,ПредопределенноеЗначение("Перечисление.ВидыОпераций.ОплатаОтКлиента"),ПараметрВидОперации);
	ПараметрВидОперации   = ?(СтрЧислоВхождений(Команда.Имя,"ОплатаОтСтраховойКомпании")   >0 ,ПредопределенноеЗначение("Перечисление.ВидыОпераций.ОплатаОтСтраховойКомпании"),ПараметрВидОперации);
    ПараметрВидОперации   = ?(СтрЧислоВхождений(Команда.Имя,"ВзносНаЛицевойСчет")          >0 ,ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВзносНаЛицевойСчет"),ПараметрВидОперации);
    ПараметрВидОперации   = ?(СтрЧислоВхождений(Команда.Имя,"ВозвратОплатыОтПоставщика")   >0 ,ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВозвратОплатыОтПоставщика"),ПараметрВидОперации);
    ПараметрВидОперации   = ?(СтрЧислоВхождений(Команда.Имя,"ПоступлениеИзБанка")          >0 ,ПредопределенноеЗначение("Перечисление.ВидыОпераций.ПоступлениеИзБанка"),ПараметрВидОперации);
    ПараметрВидОперации   = ?(СтрЧислоВхождений(Команда.Имя,"ВозвратОтПодотчетника")       >0 ,ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВозвратОтПодотчетника"),ПараметрВидОперации);
	ПараметрВидОперации   = ?(СтрЧислоВхождений(Команда.Имя,"ВозвратОплатыКлиенту")        >0 ,ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВозвратОплатыКлиенту"),ПараметрВидОперации);
	ПараметрВидОперации   = ?(СтрЧислоВхождений(Команда.Имя,"ВозвратНалога")               >0 ,ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВозвратНалога"),ПараметрВидОперации);
	ПараметрВидОперации   = ?(СтрЧислоВхождений(Команда.Имя,"ПоступлениеОтЭквайера")       >0 ,ПредопределенноеЗначение("Перечисление.ВидыОпераций.ПоступлениеОтЭквайера"),ПараметрВидОперации);
    ПараметрВидОперации   = ?(СтрЧислоВхождений(Команда.Имя,"ВозвратЗайма")                >0 ,ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВозвратЗайма"),ПараметрВидОперации);
	ПараметрВидОперации   = ?(СтрЧислоВхождений(Команда.Имя,"ВводОстатков")                >0 ,ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВводОстатков"),ПараметрВидОперации);
	ПараметрВидОперации   = ?(СтрЧислоВхождений(Команда.Имя,"ВзносУчредителя")             >0 ,ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВзносУчредителя"),ПараметрВидОперации);
	ПараметрВидОперации   = ?(СтрЧислоВхождений(Команда.Имя,"ПрочееПоступление")           >0 ,ПредопределенноеЗначение("Перечисление.ВидыОпераций.ПрочееПоступление"),ПараметрВидОперации);
	ПараметрВидОперации   = ?(СтрЧислоВхождений(Команда.Имя,"ПоступлениеИзКассы")          >0 ,ПредопределенноеЗначение("Перечисление.ВидыОпераций.ПоступлениеИзКассы"),ПараметрВидОперации);
	ПараметрВидОперации   = ?(СтрЧислоВхождений(Команда.Имя,"ВозвратЗаработнойПлаты")      >0 ,ПредопределенноеЗначение("Перечисление.ВидыОпераций.ВозвратЗаработнойПлаты"),ПараметрВидОперации);
	ПараметрВидОперации   = ?(СтрЧислоВхождений(Команда.Имя, "ПоступлениеРозничнойВыручки")>0 ,ПредопределенноеЗначение("Перечисление.ВидыОпераций.ПоступлениеРозничнойВыручкиИзОперационнойКассы"), ПараметрВидОперации);
	ПараметрВидОперации   = ?(СтрЧислоВхождений(Команда.Имя, "ПоступлениеИзКассыПредприятия")>0 ,ПредопределенноеЗначение("Перечисление.ВидыОпераций.ПоступлениеИзКассыПредприятия"), ПараметрВидОперации);
	

	СтруктураПараметры = Новый Структура;
	СтруктураПараметры.Вставить("Основание", Новый Структура("ВидОперации, ТипДенежныхСредств, Отбор", ПараметрВидОперации, ПараметрТипДенСредств, Новый Структура("Контрагент, СтруктурнаяЕдиница, Касса", ОтборКонтрагентСотрудник, ОтборСтрЕдиница, ОтборКассаБанковскийСчет)));
	// СтруктураПараметры.Вставить("Отбор", Новый Структура("Контрагент, СтруктурнаяЕдиница, Касса", ОтборКонтрагентСотрудник, ОтборСтрЕдиница, ОтборКассаБанковскийСчет));
	ОткрытьФорму("Документ.ПоступлениеДенежныхСредств.ФормаОбъекта", СтруктураПараметры);

КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "НачалоВыбора"
//
Процедура КассаОтборНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ОтборСтрЕдиница) Тогда 
		СтандартнаяОбработка = Ложь;
		ОткрытьФорму("Справочник.Кассы.ФормаВыбора", Новый Структура("Отбор", Новый Структура("СтруктурнаяЕдиница", ОтборСтрЕдиница)),,,,, Новый ОписаниеОповещения("КассаОтборНачалоВыбораЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	Иначе 
		СтандартнаяОбработка = Истина;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
// Процедура - Касса отбор начало выбора завершение
//
// Параметры:
//  Результат				 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура КассаОтборНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда 
		ОтборКассаБанковскийСчет = Результат;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ОбработкаВыбора"
//
Процедура СтрЕдиницаОтборОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение <> ОтборСтрЕдиница Тогда
		ОтборКассаБанковскийСчет = ПредопределенноеЗначение("Справочник.Кассы.ПустаяСсылка");
		ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Касса", ОтборКассаБанковскийСчет, ЗначениеЗаполнено(ОтборКассаБанковскийСчет));
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "Очистка"
//
Процедура СтрЕдиницаОтборОчистка(Элемент, СтандартнаяОбработка)
	
	ОтборКассаБанковскийСчет = ПредопределенноеЗначение("Справочник.Кассы.ПустаяСсылка");
	
КонецПроцедуры

&НаКлиенте
// Загрузить выписки из банка(механизм клиент банка)
Процедура ЗагрузитьВыписку(Команда)
	ОбщегоНазначенияКлиентСтоматология.ЗагрузитьДанныеИзФайлаВыписки(УникальныйИдентификатор, "kl_to_1c.txt");
КонецПроцедуры


#КонецОбласти
